Revit 2024 API
WorksharingTooltipInfo Methods
The WorksharingTooltipInfo type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetRequesters
 The ordered list of unique user names of users who have outstanding editing requests for the specified element.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
WorksharingTooltipInfo Class
Autodesk.Revit.DB Namespace